[
  {
    "location": "Missoula, MT",
    "date_start": "2014-08-01",
    "date_end": "2025-11-01",
    "summary": "Helen flew to Texas to visit family and I celebrated Halloween with my friends for my last night in Missoula. I said my goodbyes and then hit the road for Utah.",
    "photos": [
      {
        "caption": "A selfie from the van as we pulled out of our house for the last time.",
        "pth": "images/000_missoula/leaving_home.webp"
      },
      {
        "caption": "Going on a walk with friends before leaving Missoula.",
        "pth": "images/000_missoula/walk_with_pals.webp"
      }
    ]
  },
  {
    "location": "Goodenough Creek Campground, ID",
    "date_start": "2025-11-01",
    "date_end": "2025-11-02",
    "summary": "Maya and I stopped for the night on the way to Utah. Watched 'The House on Haunted Hill' while we cooked dinner. Helen isn't a big fan of old movies so I'm making to sure to get my fill in the coming days.",
    "photos": [
      {
        "caption": "Cooking pasta for dinner and watching 'The House on Haunted Hill'.",
        "pth": "images/001_pre_helen/first_night_solo.webp"
      }
    ]
  },
  {
    "location": "Apple Valley, UT",
    "date_start": "2025-11-02",
    "date_end": "2025-11-05",
    "summary": "Eventually made it to the Gooseberry Mesa in southern Utah. On the day I arrived I was able to get in a nice quick mountain bike ride before the sun set. Spent 3 days here at a nice camp site with good access to the bike trails. Split my time between working, running, biking, and watching movies once the sun went down. I got my fill of movies in, watching The Apartment, The Thing, and finishing the Lonesome Dove series. The only downside was that as a novice vanlifer, I chose a camping spot in the shade. This meant our battery system didn't recharge and I lost power on the night of my stay. From Maya's perspective, the downsides were that A) Helen wasn't there (tear emoji) and B) I took her on either a big bike ride or run every day (exercising is hard).",
    "photos": [
      {
        "caption": "The camping situation at the Gooseberry Mesa.",
        "pth": "images/001_pre_helen/mesa_camp.webp"
      },
      {
        "caption": "Another view of camp on Gooseberry Mesa.",
        "pth": "images/001_pre_helen/mesa_setup.webp"
      },
      {
        "caption": "Maya soaking up the sun while I worked.",
        "pth": "images/001_pre_helen/maya_soaking.webp"
      },
      {
        "caption": "A beautiful view I got from the the mesa while I was on a run.",
        "pth": "images/001_pre_helen/mesa_view.webp"
      },
      {
        "caption": "Maya has decided that if we take more than 5 minutes to pick up her poop, she must bury it with her snout.",
        "pth": "images/001_pre_helen/maya_snout.webp"
      }
    ]
  },
  {
    "location": "Las Vegas, NV",
    "date_start": "2025-11-06",
    "date_end": "2025-11-11",
    "summary": "A group of Helen's friends booked an AirBnB in Las Vegas for their birthday, so we set up our van in their driveway and joined them. I have been to Las Vegas a number of times but I was either a little kid, or camped out at Red Rocks on a climbing trip. Neither Helen nor I had visited the city itself in our adult lives. Despite it not being our usual scene, we both had a blast. {photo1} {photo2} We walked along Fremont Street and the Strip, played Top Golf, got all-you-can-eat sushi, and visited Meow Wolf! {photo3} After our visit with friends, we spend a few nights camped at Red Rocks to climb and hike. The highlight was hiking the Calico Tanks trail, which was a fun hike on slick rock that ended with a view of the park and Las Vegas. {photo4} {photo5}",
    "photos": [
      {
        "caption": "Goofing around in the Arts District",
        "pth": "images/vegas_area/cutouts.JPG"
      },
      {
        "caption": "Goofing around in the Arts District (the sequel)",
        "pth": "images/vegas_area/moon_guy.JPG"
      },
      {
        "caption": "Exploring meow wolf!",
        "pth": "images/vegas_area/meowwolf.jpeg"
      },
      {
        "caption": "Hiking into the Calico Tanks",
        "pth": "images/vegas_area/tanks.JPG"
      },
      {
        "caption": "View from the top of Calico Tanks",
        "pth": "images/vegas_area/calico_tanks.JPG"
      }
    ]
  },
  {
    "location": "Boulder City, NV",
    "date_start": "2025-11-11",
    "date_end": "2025-11-13",
    "summary": "On our way out of Vegas, we stopped outside Boulder City for a few nights. The first night, we were camped 'on' Lake Mead at the Boulder City Beach campground. You might think that because the campsite was called the Boulder City BEACH Campground that the sites would be right on the water's edge, but you would be wrong. For that to be true, my guess is that you would have to find a time machine and set the year to 2000, which is the last time Lake Mead was at full capacity. Since then, <a href='https://www.usbr.gov/lc/region/g4000/lakemead_line.pdf' target='_blank'> the water levels have fallen almost 200 feet</a>. All that is to say, rather than being camped on the beach, Helen and I had to walk 20 minutes to dip our toes in the water. After our walk to the water, we rode the mountain bike trails at Bootleg Canyon just outside of town. To say the least, these trails were puckering. Never before have I been on a blue graded mountain bike trail and thought I had a greater than 50% chance of breaking my leg. To recover from the trauma, we each treated ourselves to fries, shakes and massive cheeseburgers at Chilly Jilly's. As we were leaving town, we stopped at the Hoover Dam, the scale of which we both found very impressive. After a night camped (more or less) on the side of the highway, we took a visit to Arizona Host Springs. The setting of the springs were in a slot canyon, and made for a very unique and beautiful setting. The only issue was that we had Maya with us. For the first 50 feet of the springs, the entire width of the slot canyon was filled with water well over 110 degrees (Fahrenheit), meaning I would have to carry Maya to cooler water if we wanted to soak. This wouldn't have been an issue if there wasn't a rickety, dead vertical, 20 foot ladder right where the hot water ended. Despite her many talents, Maya is not able to climb ladders. So, instead of soaking, we hiked out and went to a beach on the Colorado River down the road, where we both took a dip and Maya got to fetch sticks in the water to her heart's content.",
    "photos": [
      {
        "pth": "images/003_boulder_city/boulder_beach.webp",
        "caption": "The view of the Lake Mead after our long walk to the beach"
      },
      {
        "pth": "images/003_boulder_city/maya_in_water.webp",
        "caption": "Maya enjoying a morning swim in Lake Mead"
      },
      {
        "pth": "images/003_boulder_city/jillys.webp",
        "caption": "Chilly Jillys, where we got burgers and shakes"
      },
      {
        "pth": "images/003_boulder_city/the_dam.webp",
        "caption": "Our view from the top of the Hoover Dam"
      },
      {
        "pth": "images/003_boulder_city/the_dam_view.webp",
        "caption": "The view from the top of the Hoover Dam. You can see the 'Bathtub Ring, which marks where the water once reached up to."
      },
      {
        "pth": "images/003_boulder_city/the_springs.webp",
        "caption": "Walking through the slot canyons into the Arizona Hot Springs"
      },
      {
        "pth": "images/003_boulder_city/the_riv.webp",
        "caption": "The beach we visited after failing to soak in the hot springs. A nice consolation prize!"
      }
    ]
  },
  {
    "location": "Burro Creek Campground, AZ",
    "date_start": "2025-11-13",
    "date_end": "2025-11-14",
    "summary": "A little campground that my dad recommended on the way home to Tucson. We pulled in late and left early so not much to report. They didn't have running water during our visit, so they waived camping fees!",
    "photos": [
      {
        "pth": "images/004_burro_ck/burro_ck.webp",
        "caption": "Before we took off in the morning, we went on a morning walk with our coffee down to the creek. Calling it a creek is a little generous, it was more of a chain of pools of standing water. But a pretty view nonetheless."
      }
    ]
  },
  {
    "location": "Tucson, AZ",
    "date_start": "2025-11-14",
    "date_end": "2025-11-24",
    "summary": "We had initially been planning to visit my family in Tucson for Thanksgiving and decided to move up our arrival date when the forecast in Northern Arizona showed nothing but rain and cold. We had a very nice and relaxing time visiting my family in Tucson. My dad helped Helen and I put the finishing touches on our van build. We added a little step that covered the the heater duct, a fold out table at the end of our counter, a windowsill that covered a number of miscellaneous cables. We also updated our propane system so that it supplied propane to both our stove and our water heater, and used a solenoid to control the flow of gas. This ended up being a more involved process that expected and featured many trips to Ace Hardware and a number of expletives. Luckily, we were able to get it working, and now get to press a fancy button before using our stove!",
    "photos": [
      {
        "pth": "images/005_tucson/maya_and_the+_gals.webp",
        "caption": "Maya hanging out on the couch with Colin's parent's dogs, Sasha and Keeley."
      }
    ]
  },
  {
    "location": "Molino Basin Campground, AZ",
    "date_start": "2025-11-24",
    "date_end": "2025-11-26",
    "summary": "Since 2018, I have had a personal climbing goal to climb at least one 5.12 every year. When I started getting into running a few years ago, I was still climbing enough that this goal was difficult, but obtainable. However, this year I have ran more and climbed less than at any point in the last ten years, meaning I hadn't yet sent a 5.12 in 2025. My mini-goal of this outing was to check off the climbing goal. After doing a few warm up climbs and then trying a 5.12, it quickly became very apparent that it was not going to happen. While I felt a little sad in the moment, in the days and week since, it has felt refreshing and exciting to not be chasing that goal. When we have been climbing since that day, it has just been because it is an activity I love, and not because I'm chasing an arbitrary goal. So, while the climbing objective was a fail for our trip to Mt Lemmon, it was still a great trip. We had our first campfire of van life, ate s'mores, enjoyed two beautiful sunsets, and Maya got to enjoy a nice hike along the Arizona Trail.",
    "photos": [
      {
        "pth": "images/006_lemmon/lemmon_camp.webp",
        "caption": "A view from our camp the first night on Mt Lemmon."
      }
    ]
  },
  {
    "location": "Tucson, AZ",
    "date_start": "2025-11-26",
    "date_end": "2025-12-06",
    "summary": "After returning from our mini camping trip, my college roommate Aiden and his wife Rosie came to Tucson to stay with my family for Thanksgiving. It was great to see them both and we had a great time running, biking and chatting. Highlights of their visit included <ul><li>Riding 'The Lemmon Drop' mountain bike trail, which made the trails in Boulder City look like child's play</li><li>Seeing the new Wicked movie with Helen, Aiden, Rosie and my mom, who insisted on getting the largest popcorn available (and of course getting a refill.)</li><li>Having a lovely Thanksgiving dinner with all of our favorite dishes, followed by watching the new movie 'Eddington' (which received a thumbs sideways to thumbs down from all viewers that night).</li></ul>",
    "photos": [
      {
        "pth": "images/007_tucson/thanksgiving.webp",
        "caption": "The Thanksgiving dinner spread."
      }
    ]
  },
  {
    "location": "Peralta Regional Park, AZ",
    "date_start": "2025-12-06",
    "date_end": "2025-12-07",
    "summary": "We stopped at the Peralta Regional Park on our way up to Durango to visit Helen's family. We went on a nice hike around the campground and watched 'The Devil Wears Prada' that night. In the morning, we drank coffee and read our books in the sun, then went on a run before hitting the road.",
    "photos": [
      {
        "pth": "images/008_peralta/gaming_at_camp.webp",
        "caption": "Helen beating Colin at a game of wingspan at the camp picnic table."
      },
      {
        "pth": "images/008_peralta/peralta.webp",
        "caption": "A nice view of the mountains visible from camp around sunset."
      }
    ]
  },
  {
    "location": "Peoria, AZ",
    "date_start": "2025-12-07",
    "date_end": "2025-12-09",
    "summary": "Leaving Tucson, we made a pit stop in Peoria to visit my grandparents for a couple of days. We enjoyed a very relaxing couple of days reading in their sunroom, eating out at the local clubhouse, watching lots of Joe Pickett, and eating Grandpa's special ice cream sundaes. <br> <b>Helen</b>",
    "photos": [
      {
        "pth": "images/009_peoria/joe_pickett.webp",
        "caption": "A snapshot from the first season of Joe Pickett, which we binge watched while we were visiting the grandparents."
      },
      {
        "pth": "images/009_peoria/selfie.webp",
        "caption": "A selfie with the grandparents before hitting the road for Sedona."
      }
    ]
  },
  {
    "location": "Sedona, AZ",
    "date_start": "2025-12-09",
    "date_end": "2025-12-11",
    "summary": "Our biggest stop on the way to Durango was in Sedona. We spent two nights at the dispersed camping area to the west of town. On our first night there, I went on a nice run up Bear Mountain while Helen wrapped up some work. Bear mountain was a great steep trail that reminded me of doing laps up Mount Sentinel in Missoula. On our second day, Helen and I hiked up Boynton Canyon to the Subway Cave, a cool rock formation that is reminiscent of a subway station. The cave was right next to some Native American ruins, which were exciting to see since I had just started the book 'House of Rain'. by Craig Childs, which explores the history of the native people in the Southwest. On our last day, we went on a nice mountain bike ride on the way out of town.",
    "photos": [
      {
        "pth": "images/010_sedona/bear_mtn.webp",
        "caption": "My view from the top of Bear Mountain"
      },
      {
        "pth": "images/010_sedona/bear_mtn_2.webp",
        "caption": "Another view from the summit of Bear Mountain"
      },
      {
        "pth": "images/010_sedona/the_subway.webp",
        "caption": "Colin peering over the ledge at the Subway Cave."
      },
      {
        "pth": "images/010_sedona/the_subway_hike.webp",
        "caption": "Helen and Colin on their hike to Subway Cave."
      }
    ]
  },
  {
    "location": "Flagstaff, AZ",
    "date_start": "2025-12-11",
    "date_end": "2025-12-12",
    "summary": "As we drove up the road heading out of Sedona, I soon realized that our elevation gain heading to Flagstaff meant we had a chillier night ahead of us. Those who know me well will not be surprised that I have been a little obsessed with finding the warmest places possible for us to spend our time. <br><br> We pulled off the highway onto a forest service road right as the sun was setting. The road was a little rough and bumpy but luckily short and it soon opened up on a wide forested area, which we were surprised to see we had all to ourselves. We set up our camp chair to watch the sun dip behind the trees, then quickly retreated into the van to make dinner and watch a movie. We have come up with a new system this year where we rotate the movie decision from me, to Colin, to a joint choice, to try to eliminate the hours we spend trying to choose a movie. Tonight was Colin's choice, Stand By Me, which I have to admit I quite enjoyed, even though it was old. The next morning, we set out early in search of some sport climbing at The Pit, which Colin assured me would be sunny and warm. Our toilet got its inaugural moment that morning when we pulled up to the trailhead and realized there was no bathroom. Lucky for us, our home is now our bathroom and our bathroom is our home. The climbing was fun and indeed hot, and I was happy to be baked by the morning sun. We wrapped up climbing a little early so that we could make it to Durango that night and try to avoid nighttime driving (because my mom told me to). Before we headed out of Flagstaff, we made one important stop at Pizzicleta, a deliciously simple Italian pizza shop downtown that is definitely worth a visit if you are in the area. I'd go back just for the homemade chocolate gelato. <br><b>Helen</b>",
    "photos": [
      {
        "pth": "images/011_flagstaff/pizza.webp",
        "caption": "Helen enjoying a slice of pizza from Pizzicletta in Flagstaff."
      },
      {
        "pth": "images/011_flagstaff/the_pizza.webp",
        "caption": "Colin enjoying a slice of pizza from Pizzicletta."
      },
      {
        "pth": "images/011_flagstaff/the_pitt.webp",
        "caption": "Some of the walls at The Pit climbing area."
      }
    ]
  },
  {
    "location": "Durango, CO",
    "date_start": "2025-12-12",
    "date_end": "2025-12-28",
    "summary": "We arrived to my home in Durango later that night to a big hug from my mom, a hot shower, and Chinese takeout. Three of my very favorite things. We spent the next couple of weeks wrapping up our respective jobs and spending time with my family. We sadly did not get any snow so our skis made the long and crammed journey to Colorado for nothing. Instead, we went on lots of walks, played disc golf, watched football and the holiday baking show, cooked and ate lots of good food, and visited with friends. Other highlights include meeting my parents new puppy Sunny, attempting to bake Paul Hollywood's Noel de Buche, my dad helping us build out the storage in the back of the van, playing Bonanza (Beans!!) and a lovely Christmas day with the whole family at home.  <br><br><b>-Helen</b>",
    "photos": [
      {
        "pth": "images/012_durango/exploring.webp",
        "caption": "A little hike with Helen's family."
      },
      {
        "pth": "images/012_durango/family_hike.webp",
        "caption": "A selfie from a family hike after Christmas."
      },
      {
        "pth": "images/012_durango/organizing_the_back.webp",
        "caption": "The last improvement we wanted to make to our van was adding better storage organization in the back. Helen's dad helped us build some shelves with slide out drawers in the back!"
      },
      {
        "pth": "images/012_durango/hohoho.webp",
        "caption": "Santa after coming down the chimney."
      },
      {
        "pth": "images/012_durango/more_santas.webp",
        "caption": "Our outfits for Christmas decoration."
      },
      {
        "pth": "images/012_durango/xmas_dogs.webp",
        "caption": "Maya getting to know Helen's parent's new dog, Sunny."
      }
    ]
  },
  {
    "location": "Page, AZ",
    "date_start": "2025-12-28",
    "date_end": "2025-12-29",
    "summary": "Driving away from Heartwood, it felt like we were officially embarking on our van life adventure. No more things to build, no more work to fill our days and nothing on the agenda other than heading towards Vegas to meet up with Missoula friends to ring in the new year. For our first night on the road, we found a small desert site, White House Campground, set against the sandstone in Paria Canyon. When we arrived, we took a short walk down to a trickling river to let Maya stretch her legs. The night was chilly and clear with a small, bright moon and our little heater kept us warm and cozy. In the morning we made coffee to take with us on our morning walk, which is becoming our ritual. We strolled down a sandy wash until we came upon the Nautilus, a small slot in the rock that you could walk through. We stayed high on the rock and managed to find a route home, only getting cliffed out once or twice. When we stopped for the night, we didn't realize we were in an area with such cool slot canyons! Having never really been in slot canyons, I was surprised at how they can appear almost out of nowhere, walls suddenly appearing around a small bend. That morning, we decided to take a small detour to hike on the Wire Pass Trail, a hike that meandered through a desert wash, dropped us into slot canyons, and ended at the confluence with Buckskin Gulch where there was a cave covered in hand-print petroglyphs. There were a couple of 10-foot drops in the slots, and Colin had to one-handedly carry Maya up and down wooden ladders (both Maya and Colin survived). <br><br> <b>-Helen</b>",
    "photos": [
      {
        "pth": "images/013_whitehouse/camp_view.webp",
        "caption": "Maya doing her business after arriving to camp at the Whitehouse Campground."
      },
      {
        "pth": "images/013_whitehouse/coffee_on_hike.webp",
        "caption": "Colin sipping his morning coffee during our morning hike."
      },
      {
        "pth": "images/013_whitehouse/the_nautilus.webp",
        "caption": "The sandstone 'Nautilus' that we went looking for on our monring hike."
      },
      {
        "pth": "images/013_whitehouse/more_nautilus.webp",
        "caption": "Another view of the nautilus."
      },
      {
        "pth": "images/013_whitehouse/helen_making_colin_scramble.webp",
        "caption": "Helen making Colin scramble up a spooky cliff while Maya watches dubiously."
      },
      {
        "pth": "images/013_whitehouse/selfie.webp",
        "caption": "A selfie from our morning hike."
      },
      {
        "pth": "images/013_whitehouse/summit_view.webp",
        "caption": "A view of the Paria River from the high point of our morning hike."
      },
      {
        "pth": "images/013_whitehouse/maya_hugs.webp",
        "caption": "Maya giving Colin some love on the hike to Wire Pass."
      },
      {
        "pth": "images/013_whitehouse/the_slot.webp",
        "caption": "The slot canyon on the Wire Pass trail."
      },
      {
        "pth": "images/013_whitehouse/helping_maya.webp",
        "caption": "There were a few stretches of the slot canyon where Maya needed a helping hand."
      },
      {
        "pth": "images/013_whitehouse/slot_selfie.webp",
        "caption": "A selfie from the slot canyon."
      },
      {
        "pth": "images/013_whitehouse/handprints.webp",
        "caption": "Petroglyphs of hand prints at the end of the Wire Pass hike."
      },
      {
        "pth": "images/013_whitehouse/maya_snoozing.webp",
        "caption": "Maya getting in her beauty sleep after a big day of activities."
      }
    ]
  },
  {
    "location": "Las Vegas, NV",
    "date_start": "2025-12-29",
    "date_end": "2026-01-03",
    "summary": "Our first official stop as unemployed, full-time vanlifers! Some friends from Missoula were camping out at Red Rocks to climb for the New Year, so we joined them for a few days of climbing and visiting. Unfortunately, the cold and rainy weather didn't make for good climbing. The rock in Red Rocks is sandstone, which is easily damaged if climbed on when wet. We didn't end up doing much climbing, but went on a mountain bike ride, some nice hikes and runs, and got some great Thai food with friends on New Year's Day in Chinatown.",
    "photos": [
      {
        "pth": "images/014_vegas/gaming.webp",
        "caption": "A game of chess played in the van while avoiding the rain. Chess is becoming one of our favorite activities!"
      },
      {
        "pth": "images/014_vegas/vegas_camp.webp",
        "caption": "A view out the van of our camp at Red Rocks."
      },
      {
        "pth": "images/014_vegas/turtlehead_peak.webp",
        "caption": "Helen and Maya celebrating the summit of Turtlehead Peak."
      },
      {
        "pth": "images/014_vegas/turtlehead_view.webp",
        "caption": "The view from the top of Turtlehead Peak."
      },
      {
        "pth": "images/014_vegas/post_run_snack.webp",
        "caption": "Colin stopping to get some roadside elote as a post run snack."
      }
    ]
  },
  {
    "location": "Mojave National Preserve",
    "date_start": "2026-01-03",
    "date_end": "2026-01-04",
    "summary": "On our way to Joshua Tree, we stopped for the night at an area called Granite Pass in the Mojave National Preserve. The weather was very cold, windy and cloudy, but we still did some scrambling and exploring in the boulder fields around camp.",
    "photos": [
      {
        "pth": "images/015_mojave/boulder_hopping.webp",
        "caption": "Wandering around the boulder fields."
      },
      {
        "pth": "images/015_mojave/boulders.webp",
        "caption": "Our view from camp."
      },
      {
        "pth": "images/015_mojave/granite_pass.webp",
        "caption": "Our camping spot at Granite Pass"
      }
    ]
  },
  {
    "location": "Hidden Valley Campground, California",
    "date_start": "2026-01-04",
    "date_end": "2026-01-07",
    "summary": "Me write",
    "photos": [
      {
        "pth": "images/016_jtree/climbing.webp",
        "caption": "Colin and Helen on top of 'The Blob' formation after climbing a 5.7+ called Buissonier. A fun little outing!"
      },
      {
        "pth": "images/016_jtree/gaming.webp",
        "caption": "A chess game while taking a break from climbing."
      },
      {
        "pth": "images/016_jtree/hidden_valley.webp",
        "caption": "The Hidden Valley Campground as seen from our camp site."
      },
      {
        "pth": "images/016_jtree/jtree_singular.webp",
        "caption": "A pair of joshua trees seen on our morning hike"
      },
      {
        "pth": "images/016_jtree/jtree_plural.webp",
        "caption": "Some more j-trees."
      },
      {
        "pth": "images/016_jtree/maya_the_boss.webp",
        "caption": "Maya leading the way on our morning walk."
      },
      {
        "pth": "images/016_jtree/sunset_in_bed.webp",
        "caption": "View of sunset from our bed."
      },
      {
        "pth": "images/016_jtree/sunset_tree.webp",
        "caption": "A joshua tree in the sunset"
      },
      {
        "pth": "images/016_jtree/sunset.webp",
        "caption": "Another glimpse of sunset."
      },
      {
        "pth": "images/016_jtree/bad_camp.webp",
        "caption": "Colin playing ball with Maya at the dispersed camping outside Joshua Tree."
      }
    ]
  },
  {
    "location": "Borrego Springs, CA",
    "date_start": "2026-01-07",
    "date_end": "2026-01-09",
    "summary": " Me write",
    "photos": [
      {
        "pth": "images/017_borrego/more_sculptures.webp",
        "caption": "One of the many life sized metal sculptures in Borrego Springs."
      },
      {
        "pth": "images/017_borrego/dubious_maya.webp",
        "caption": "Maya growling at some javelina."
      },
      {
        "pth": "images/017_borrego/the_details.webp",
        "caption": "The sculptures were very detailed!"
      },
      {
        "pth": "images/017_borrego/view_from_trail.webp",
        "caption": "A picture taken on one of Colin's runs on the trail between Borrego Springs and camp."
      }
    ]
  },
  {
    "location": "Julian, CA",
    "date_start": "2026-01-09",
    "date_end": "2026-01-10",
    "summary": "As we drove away from the Borrego Springs area, the scenery quickly changed from sprawling desert to twisty mountain roads covered in greenery. We headed for one of the few dog-friendly hikes in the area, Volcan Mountain. The wind from the last few days followed us so we bundled up in full winter coats and hats. The hike steadily gained elevation with views of the San Diego valley, and we eventually spotted the ocean! The summit was an open, grassy field that left us no reprieve from the wind. We had a short picnic before running down the hill to escape the blusters. I decided that we probably needed to treat ourselves to pie and coffee in the nearby town of Julian, which seems to be famous for its apple pies. We got a dutch apple pie with vanilla ice cream that hit the spot. The town was very cute, full of historic hotels, small candy shops, gift boutiques, and little stores catering to hikers on the Pacific Crest Trail. After walking the full stretch of main street, we headed over to our home for the night, Heroes Woodfire Pizza. This was our first night trying out Harvest Host, which is a platform you can join that lets you stay for free at small businesses such as wineries, breweries, farms, etc., with the expectation that you'll buy something in return. Tonight, we were treating ourselves to pizza and live music. <br><br> <b>-Helen</b>",
    "photos": [
      {
        "pth": "images/018_julian/hike_view.webp",
        "caption": "Our view from the top of Volcan Mountain"
      },
      {
        "pth": "images/018_julian/windy_hike.webp",
        "caption": "It was a very windy and cold day for a hike, so we were bundled up."
      }
    ]
  },
  {
    "location": "Dulzura, CA",
    "date_start": "2026-01-10",
    "date_end": "2026-01-11",
    "summary": "We made our way southwest on more twisting, mountain roads. We stopped for a short run/hike, which ended up being a full-on bushwack before continuing on to our next Harvest Host destination, Dulzura Vineyad & Winery. There was a nice lot for us to park on surrounded by guava and key lime trees and set near a small creek. We enjoyed a wine tasting with one of the owners of the winery, where we sampled wine and listened to the history of his life and the property. <br><br> <b>-Helen</b>",
    "photos": null
  },
  {
    "location": "Encinitas, CA",
    "date_start": "2026-01-11",
    "date_end": "2026-01-13",
    "summary": "Stepping out of the car in the little town of Encinitas, it felt like we were really in California. It was warm enough to walk around in a tank top and you could feel the thick, salty air. We had a couple of hours to kill before our camping check-in we we explored San Elijo Lagoon and Ecological Reserve. We have been very into looking at and identifying birds since we watched the movie Listers, and there were lots of cool birds we had never seen before, including my favorite of the outing, the Bufflehead. <br><br> Campgrounds in California are much more regulated than we are used to. We tried to check in at 1pm only to be told we had to return at 2pm, which we did, only to get in a line of cars all waiting to check in. The sites were all close together but we had a view of the ocean, hot showers and a beach just a minutes walk away so I was pretty happy. After a hot shower, I spent the evening reading on the beach until sunset while Colin went on a run. We spent the next day exploring the town, Cardiff by the Sea and enjoying time on the beach. On our way out of town the following day, we stopped at the Self Realization Fellowship Meditaion Gardens, which contatined beatuiful plants, ocean views and lots of little benches for sitting and pondering. <br><br> <b>-Helen</b>",
    "photos": [
      {
        "pth": "images/020_encinitas/lagoon.webp",
        "caption": "The San Elijo Lagoon, where we did our first ever session of birding."
      },
      {
        "pth": "images/020_encinitas/beach_dog.webp",
        "caption": "Maya getting sandy."
      },
      {
        "pth": "images/020_encinitas/beach_reading.webp",
        "caption": "A lazy afternoon reading on the beach"
      },
      {
        "pth": "images/020_encinitas/sunset.webp",
        "caption": ""
      },
      {
        "pth": "images/020_encinitas/sunset2.webp",
        "caption": ""
      },
      {
        "pth": "images/020_encinitas/retreat_view.webp",
        "caption": "The view from the Self Realization retreat meditation gardens."
      }
    ]
  },
  {
    "location": "Rainbow, CA",
    "date_start": "2026-01-13",
    "date_end": "2026-01-14",
    "summary": "Our first impression of our Harvest Host home for the night was that the driveways were quite steep! We tentatively drove up to a barn, not sure what we would find, and were greeted by a friendly woman, Yolanda, and three barking dogs. We hopped in her 4x4 and she showed us where we could sleep for the night but it was up a very steep, dirt road that both Colin and I were too scared to drive so she directred us to a lower pullout right alongside endless rows of passionfruit vines. We had a quiet evening listenting to the coyotes and frogs from the nearby pond. As we were headed out in the morning, Yolanda loaded us up with a bag full of passionfruit, lemons, macadamia nuts and a bottle of fresh squeezed lemon juice. We also got to pick our own avocaods from their trees, and they were some of the biggest avocaods I have ever seen. We chatted a bit with her and her husband, exchaning stories of Montana, before we hit the road again.",
    "photos": [
      {
        "pth": "images/021_orchard/orchard_view.webp",
        "caption": "The view from our camp spot at the orchards"
      },
      {
        "pth": "images/021_orchard/orchard_haul.webp",
        "caption": "Our haul of goodies that we bought from the orchard, including lemons, avocados, passionfruit and macadamia nuts."
      }
    ]
  },
  {
    "location": "Idyllwild, CA",
    "date_start": "2026-01-14",
    "date_end": "2026-01-17",
    "summary": "After spending a few days along the coast, we decided to head up into the mountains near Idyllwild. On our first night, we found a free dispersed camping spot in Apple Canyon, a few miles to the south of Idyllwild. From camp, I decided head out for a run and Helen joined on her bike. According to the internet, the route we chose was a popular biking trail. The fact that within two miles of leaving the trailhead we were bushwhacking and fighting to follow a faint cattle trail had me thinking otherwise. Regardless of the poor trail conditions, we ended up having a nice outing, and finished the day eating tofu bowls and watching Slow Horses in bed. The next day, we headed into Idyllwild and did some mountain biking. We found a nice trail system called The Hub that had much flowier trails compared to the straight up and straight down trails that we are used to riding in Missoula. For dinner, we decided to use some of our finite dining out budget to eat at the Idyllwild Brewpub, which was a great choice. We both had teryaki burgers that reminded me of a childhood vacation to Hawaii where we ate burgers drenched in teryaki sauce at least three nights of the trip. The next morning, I went for a long run up the highest peak in the region, Mt San Jacinto, while Helen took Maya on a hike. It was a great outing and I was able to make it up the peak, despite the snow and ice on the last few miles of trail. Once we were back into town, we decided to visit the local movie theater to watch The Housemaid. Helen and I had listened to the audiobook of The Housemaid a few months prior and were excited to see the film. We both enjoyed the movie, the quirky local theater, and the large bucket of popcorn (plus refill). <br><br> On our final day in the area, we planned to go climbing at the ominously named Suicide Rock. As we were getting ready to hike to the climbing area, I suddenly felt like I didn't want to go climbing, and almost told Helen we should just bail and go on a hike. However, I pushed the thought out of my head, since I have wanted to climb at Suicide for many years, it being a historically significant climbing area. We made the hike in and decided to warm up on a 5.8 called Hernia. The pitch quickly became a comedy of errors, between a stuck cam and a broken trigger on a second cam. As I approached the crux, I reached into an undercling and fidgeted around in it for a few seconds, when I suddenly realized I was touching something mushy and damp. I pulled my hand out and peeked into the undercling, expecting to find a mossy seep, but instead came eye to eye with a bat. The undercling was both a crucial hold and gear placement, so I decided to downclimb, not wanting to disturb the bat any further. We both had vague ideas that bats could have rabies and that rabies equals almost certain death, but we didn't think too much of the incident at the time. It wasn't until an afternoon of more failed climbing and shelling out $30 for a campsite that could best be described as 'mid' that we looked up what you should do if you're in close contact with a bat. Step 1: Thoroughly wash your hands for 15 minutes (oops). Step 2: Immediately go to the ER (oops). After some phone calls with my mom and her doctor colleagues, we decided it would be a best to drive into San Bernadino and visit the ER. Wounds from bat bites can be extremely small and hard to see. I had a number of small nicks and scrapes on my hands from climbing, so there was no real way to tell if I had indeed been bitten or scratched by the bat. So, we ditched camp and made the hour and a half drive into the city. Upon reaching the ER, I was promptly seen by a physician's assistant, who listened to my story, glanced at my hand, and said 'I think you're fine, plus the rabies shots hurt'. I said that I would rather be safe than sorry, seeing as the consequence of not getting the shots and contracting rabies is almost certainly death. However, this argument held no sway. Me being a person who doesn't like conflict, I reluctantly left the ER without the shots. Feeling dejected, Helen and I got Taco Bell for dinner and spent more of our dwindling monthly budget on a way too expensive hotel room. Luckily, watching the Food Network in hotel rooms is one of my favorite pastimes, so I was able to rest easily that night. <br><br><b>-Colin</b>",
    "photos": [
      {
        "pth": "images/022_idyllwild/dinner_first_night.webp",
        "caption": "A delicious tofu bowl that Helen made for dinner our first night in the Idyllwild area"
      },
      {
        "pth": "images/022_idyllwild/cold_plunge.webp",
        "caption": "A natural pool that we hiked to, suggested by a local we met in camp. Colin took a moring cold plunge in the pool."
      },
      {
        "pth": "images/022_idyllwild/big_cone.webp",
        "caption": "One of the many massive pine cones in the area"
      },
      {
        "pth": "images/022_idyllwild/food_storage.webp",
        "caption": "Woodpecker acorn storage for the winter."
      },
      {
        "pth": "images/022_idyllwild/comfy_position.webp",
        "caption": "Maya resting in a unique position after a big day of activities."
      },
      {
        "pth": "images/022_idyllwild/brewery_dinner.webp",
        "caption": "Dinner at the Idyllwild Brewpub. We enjoyed the food and beer and were happy to have spent our limited eating out budget here!"
      },
      {
        "pth": "images/022_idyllwild/summit.webp",
        "caption": "Colin on top of Mt San Jacinto."
      },
      {
        "pth": "images/022_idyllwild/summit_view.webp",
        "caption": "The view from the top of Mt san Jacinto."
      }
    ]
  },
  {
    "location": "San Bernadino, CA",
    "date_start": "2026-01-17",
    "date_end": "2026-01-18",
    "summary": "After a morning of googling, asking AI, and more consulting with doctor and nurse friend over a continental breakfast, we decided that I should go back to the ER and tell them that I was getting the rabies shot whether they thought I should or not. As a very conflict-averse person, it was hard for me to put my foot down and advocate for myself, but at the end of the day I received the vaccinations. After receiving three immunoglobulin injections and another shot for the rabies vaccine, I learned that I would need subsequent vaccinations in 3, 7 and 14 days (oh boy)!",
    "photos": null
  },
  {
    "location": "Sawtooth Canyon Campground, CA",
    "date_start": "2026-01-18",
    "date_end": "2026-01-21",
    "summary": "Sawtooth Canyon Campground is a free BLM climbers campground in the middle of nowhere dessert amidst volcanic rock formations. After the stress and of getting Colin's shots, eating bad taco bell, and the general chaos of the city, it was nice to be back in the van surrounded by sky and rocks. We spent a couple of days reading in the morning sun and climbing sport routes in the afternoon.",
    "photos": [
      {
        "pth": "images/024_new_jack/nap_time.webp",
        "caption": "Maya laying down for a nap while Helen and Colin climb."
      },
      {
        "pth": "images/024_new_jack/rapping.webp",
        "caption": "Colin rappelling off a route in New Jack City."
      },
      {
        "pth": "images/024_new_jack/rocks.webp",
        "caption": "The rocks at New Jack City."
      }
    ]
  },
  {
    "location": "Rancho Jurupa Regional Park, CA",
    "date_start": "2026-01-21",
    "date_end": "2026-01-22",
    "summary": "On Sunday, we had to head back into civilization to get Colin his second of four rounds of the rabies shot. We made our way back into San Berndadino, where I spent the afternoon in the van, and Colin spent it in the Loma Linda urgent care. We figured paying for a campground was cheaper than getting a hotel, so we booked a night at Rancho Jarupa Regional Park, which promised a disc golf course, showers, and a laundry room. Of those three amenities, the laundry room turned out to be the nicest. The highlight of this city park was the small lake, which was definitely more like a pond, where all sorts of birds gathered. I spent the foggy morning next to the lake drinking my coffee, reading my book and trying to identify all of the birds paddling and wading in the water. There were hooded merganzers, American coots, ruddy ducks, great blue herons and great big pelicans. It's been very fun being able to recognize some of the different species where they all just looked like ducks before. <br><br> <b>-Helen</b>",
    "photos": null
  },
  {
    "location": "Leo Carrillo State Park, CA",
    "date_start": "2026-01-22",
    "date_end": "2026-01-26",
    "summary": "helen write",
    "photos": [
      {
        "pth": "images/026_leo_carrillo/beach_sunset.webp",
        "caption": "Sunset on the Leo Carrillo beach"
      },
      {
        "pth": "images/026_leo_carrillo/cave.webp",
        "caption": "A view out of the sea cave at low tide."
      },
      {
        "pth": "images/026_leo_carrillo/mussels.webp",
        "caption": "Mussels."
      },
      {
        "pth": "images/026_leo_carrillo/the_queen_of_the_van.webp",
        "caption": "Obligatory Maya sleeping picture."
      },
      {
        "pth": "images/026_leo_carrillo/tidepool.webp",
        "caption": "Sea anemonies in a tide pool at Leo Carrillo beach"
      },
      {
        "pth": "images/026_leo_carrillo/the_view2.webp",
        "caption": ""
      },
      {
        "pth": "images/026_leo_carrillo/creek_view.webp",
        "caption": "A nice little creek crossing Colin encountered on a run"
      },
      {
        "pth": "images/026_leo_carrillo/malibu_view.webp",
        "caption": "Ocean view from a little peak near camp."
      },
      {
        "pth": "images/026_leo_carrillo/more_view.webp",
        "caption": "A view of Malibu from one of Colin's runs."
      }
    ]
  },
  {
    "location": "Jumbo Rocks Campground, CA",
    "date_start": "2026-01-22",
    "date_end": "2026-01-26",
    "summary": "helen write",
    "photos": [
      {
        "pth": "images/027_jtree/post_climb.webp",
        "caption": "A selfie after climbing an awesome 4-pitch 5.6 called 'Right On'. The climb followed the right of the two parallel cracks on the rock in the background."
      }
    ]
  }
]