[
    {
      "location": "Missoula, MT",
      "date_start": "2014-08-01",
      "date_end": "2025-11-01",
      "summary": "Helen flew to Texas to visit family and I celebrated Halloween with my friends for my last night in Missoula. I said my goodbyes and then hit the road for Utah.",
      "link": null
    },
    {
      "location": "Goodenough Creek Campground, ID",
      "date_start": "2025-11-01",
      "date_end": "2025-11-02",
      "summary": "Maya and I stopped for the night on the way to Utah. Watched 'The House on Haunted Hill' while we cooked dinner. Helen isn't a big fan of old movies so I'm making to sure to get my fill in the coming days.",
      "link": null
    },
    {
      "location": "Apple Valley, UT",
      "date_start": "2025-11-02",
      "date_end": "2025-11-05",
      "summary": "Eventually made it to the Gooseberry Mesa in southern Utah. On the day I arrived I was able to get in a nice quick mountain bike ride before the sun set. Spent 3 days here at a nice camp site with good access to the bike trails. Split my time between working, running, biking, and watching movies once the sun went down. I got my fill of movies in, watching The Apartment, The Thing, and finishing the Lonesome Dove series. The only downside was that as a novice vanlifer, I chose a camping spot in the shade. This meant our battery system didn't recharge and I lost power on the night of my stay. From Maya's perspective, the downsides were that A) Helen wasn't there (tear emoji) and B) I took her on either a big bike ride or run every day (exercising is hard).",
      "link": null
    },
    {
      "location": "Las Vegas, NV",
      "date_start": "2025-11-06",
      "date_end": "2025-11-11",
      "summary": "A group of Helen's friends booked an AirBnB in Las Vegas for their birthday, so we set up our van in their driveway and joined them. I have been to Las Vegas a number of times but I was either a little kid, or camped out at Red Rocks on a climbing trip. Neither Helen nor I had visited the city itself in our adult lives. Despite it not being our usual scene, we both had a blast. We walked along Fremont Street and the Strip, played Top Golf, got all-you-can-eat sushi, and visited Meow Wolf! After our visit with friends, we spend a few nights camped at Red Rocks to climb and hike. The highlight was hiking the Calico Tanks trail, which was a fun hike on slick rock that endned with a view of the park and Las Vegas.",
      "link": null
    },
    {
      "location": "Boulder City, NV",
      "date_start": "2025-11-11",
      "date_end": "2025-11-13",
      "summary": "On our way out of Vegas, we stopped outside Boulder City for a few nights. The first night, we were camped 'on' Lake Mead at the Boulder City Beach campground. You might think that because the campsite was called the Boulder City BEACH Campground that the sites would be right on the water's edge, but you would be wrong. For that to be true, my guess is that you would have to find a time machine and set the year to 2000, which is the last time Lake Mead was at full capacity. Since then, the water levels have fallen almost 200 feet. All that is to say, rather than being camped on the beach, Helen and I had to walk 20 minutes to dip our toes in the water. After our walk to the water, we rode the mountain bike trails at Bootleg Canyon just outside of town. To say the least, these trails were puckering. I was lulled into a sense of calm by the gentle grade of the climbing trail, but that calm left quickly when something something deathgrip the whole descent something something I thought I was going to die on a blue. To recover from the trauma, we each treated ourselves to fries, shakes and massive cheeseburgers at Chilly Jilly's. As we were leaving town, we stopped at the Hoover Dam... Hot springs and river.",
      "link": null
    },
    {
      "location": "Burro Creek Campground, AZ",
      "date_start": "2025-11-13",
      "date_end": "2025-11-14",
      "summary": "A little campground that my dad recommended on the way home to Tucson. We pulled in late and left early so not much to report. They didn't have running water during our visit, so they waived camping fees.",
      "link": null
    },
    {
      "location": "Tucson, AZ",
      "date_start": "2025-11-14",
      "date_end": "2025-11-24",
      "summary": "Had a very nice and relaxing time visiting my family in Tucson.",
      "link": null
    },
    {
      "location": "Molino Basin Campground, AZ",
      "date_start": "2025-11-24",
      "date_end": "2025-11-26",
      "summary": "Escaped the heat in this mountain village near Tucson.",
      "link": null
    },
    {
      "location": "Tucson, AZ",
      "date_start": "2025-11-26",
      "date_end": "2025-12-06",
      "summary": "",
      "link": null
    },
    {
      "location": "17975 Peralta Rd, Gold Canyon, AZ",
      "date_start": "2025-12-06",
      "date_end": "2025-12-07",
      "summary": "Small desert town exploration and local culture.",
      "link": null
    },
    {
      "location": "Peoria, AZ",
      "date_start": "2025-12-07",
      "date_end": "2025-12-09",
      "summary": "Suburban Phoenix stop with hiking in nearby mountains.",
      "link": null
    },
    {
      "location": "Sedona, AZ",
      "date_start": "2025-12-09",
      "date_end": "2025-12-11",
      "summary": "Mesmerized by red rock formations and vortex energy.",
      "link": null
    },
    {
      "location": "Flagstaff, AZ",
      "date_start": "2025-12-11",
      "date_end": "2025-12-12",
      "summary": "Perfect mountain town with Route 66 history and stargazing.",
      "link": null
    },
    {
      "location": "Durango, CO",
      "date_start": "2025-12-12",
      "date_end": "2025-12-28",
      "summary": "Explored historic downtown and rode the Durango & Silverton Railroad.",
      "link": null
    },
    {
      "location": "Page, AZ",
      "date_start": "2025-12-28",
      "date_end": "2025-12-29",
      "summary": "Stood in awe at Horseshoe Bend and Antelope Canyon.",
      "link": null
    },
    {
      "location": "Las Vegas, NV",
      "date_start": "2025-12-29",
      "date_end": "2026-01-03",
      "summary": "Second Vegas visit for shows and more exploration.",
      "link": null
    },
    {
      "location": "Mojave National Preserve",
      "date_start": "2026-01-03",
      "date_end": "2026-01-04",
      "summary": "",
      "link": null
    },
    {
      "location": "Joshua Tree National Park, CA",
      "date_start": "2026-01-04",
      "date_end": "2026-01-07",
      "summary": "Hiked among otherworldly rock formations and Joshua trees.",
      "link": null
    },
    {
      "location": "Borrego Springs, CA",
      "date_start": "2026-01-07",
      "date_end": "2026-01-09",
      "summary": "Relaxed in this desert oasis with wildflowers and hot springs.",
      "link": null
    },
    {
      "location": "Julian, CA",
      "date_start": "2026-01-09",
      "date_end": "2026-01-10",
      "summary": "Charming mountain town famous for apple pie and mining history.",
      "link": null
    },
    {
      "location": "Dulzura, CA",
      "date_start": "2026-01-10",
      "date_end": "2026-01-11",
      "summary": "Quiet border town with scenic drives and local history.",
      "link": null
    },
    {
      "location": "Encinitas, CA",
      "date_start": "2026-01-11",
      "date_end": "2026-01-13",
      "summary": "Final destination! Beach time, surfing, and coastal relaxation.",
      "link": null
    },
    {
      "location": "Rainbow, CA",
      "date_start": "2026-01-13",
      "date_end": "2026-01-14",
      "summary": "",
      "link": null
    }
]